БухЭксп/Catalogs/CW_НазначенияСтатусов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_НазначенияСтатусов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВлияетНаПроведениеДокументаВБухгалтерскомУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ОбъектыНазначенийСтатусов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ОбъектыНазначенийСтатусов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>НазначениеСтатуса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_НазначенияСтатусов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектНазначенияСтатуса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Catalogs/CW_НастройкиВыводаСтатистики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_НастройкиВыводаСтатистики</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиКолонок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Синоним</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заголовок</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ширина</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредопределеннаяКолонка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗначенияСтрокой</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоступенФорматЗначения</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_НазначенияСтатусов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСписокДоступныхНазначений();
	
	Если НЕ Параметры.Ключ.Пустая() Тогда
		ЗаполнитьСписокНазначений();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокДоступныхНазначений()
	
	мДоступныеТипы = Метаданные.ОпределяемыеТипы.CW_ВладельцыСтатуса.Тип.Типы();
	
	Для Каждого ТипВладельца из мДоступныеТипы Цикл
		
		Идентификатор = ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ТипВладельца);
		СписокВыбораНазначений.Добавить(Идентификатор);
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокНазначений()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ОбъектыНазначенийСтатусов.ОбъектНазначенияСтатуса КАК ОбъектНазначенияСтатуса
	               |ИЗ
	               |	РегистрСведений.CW_ОбъектыНазначенийСтатусов КАК CW_ОбъектыНазначенийСтатусов
	               |ГДЕ
	               |	CW_ОбъектыНазначенийСтатусов.НазначениеСтатуса = &НазначениеСтатуса";
	
	Запрос.УстановитьПараметр("НазначениеСтатуса", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	ОбъектыНазначения.Очистить();
	Пока Выборка.Следующий() Цикл
		СтрокаНазначения = ОбъектыНазначения.Добавить();
		СтрокаНазначения.ИдентификаторыОбъектовМетаданных 	= Выборка.ОбъектНазначенияСтатуса;
		СтрокаНазначения.КнопкаНастройка 					= Истина;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЗаписатьИзмененияНазначений Тогда
		ЗаписатьНазначенияВРегистр();
	КонецЕсли;
	
	Если ИзменитьФлагБУПодчиненныхЭлементов Тогда
		СнятьФлагПроводитьПоБухгалтерскомуУчетуНаСервере();	
	КонецЕсли;

	
КонецПроцедуры

&НаСервере
Процедура СнятьФлагПроводитьПоБухгалтерскомуУчетуНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_СтатусыДокументов.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.CW_СтатусыДокументов КАК CW_СтатусыДокументов
	               |ГДЕ
	               |	CW_СтатусыДокументов.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтатусОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СтатусОбъект.ПроводитьПоБухгалтерскомуУчету = Ложь;
		СтатусОбъект.Записать();
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаписатьНазначенияВРегистр()
	
	Набор = РегистрыСведений.CW_ОбъектыНазначенийСтатусов.СоздатьНаборЗаписей();
	Набор.Отбор.НазначениеСтатуса.Установить(Объект.Ссылка);
	Набор.Очистить();
	
	Для Каждого СтрокаТаблицы из ОбъектыНазначения Цикл
		Если  ЗначениеЗаполнено(СтрокаТаблицы.ИдентификаторыОбъектовМетаданных) Тогда
			СтрокаНабора = Набор.Добавить();
			СтрокаНабора.НазначениеСтатуса 		 = Объект.Ссылка;
			СтрокаНабора.ОбъектНазначенияСтатуса = СтрокаТаблицы.ИдентификаторыОбъектовМетаданных;
		КонецЕсли;
	КонецЦикла;
	
	Набор.Записать(Истина);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыНазначенияПриИзменении(Элемент)
	ЗаписатьИзмененияНазначений = Истина;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЕстьДублиОбъектовНазначения(Отказ);
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		ИзменитьФлагБУПодчиненныхЭлементов = ИзменилсяФлагБухгалтерскогоУчета() И НЕ Объект.ВлияетНаПроведениеДокументаВБухгалтерскомУчете;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ИзменилсяФлагБухгалтерскогоУчета()
	Возврат  Объект.ВлияетНаПроведениеДокументаВБухгалтерскомУчете <> Объект.Ссылка.ВлияетНаПроведениеДокументаВБухгалтерскомУчете;
КонецФункции

&НаСервере
Процедура ЕстьДублиОбъектовНазначения(Отказ)
	
	мОбъектыНазначения = ОбъектыНазначения.Выгрузить().ВыгрузитьКолонку("ИдентификаторыОбъектовМетаданных");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ОбъектыНазначенийСтатусов.НазначениеСтатуса КАК НазначениеСтатуса,
	               |	CW_ОбъектыНазначенийСтатусов.ОбъектНазначенияСтатуса КАК ОбъектНазначенияСтатуса
	               |ИЗ
	               |	РегистрСведений.CW_ОбъектыНазначенийСтатусов КАК CW_ОбъектыНазначенийСтатусов
	               |ГДЕ
	               |	CW_ОбъектыНазначенийСтатусов.ОбъектНазначенияСтатуса В(&мОбъектыНазначения)
	               |	И CW_ОбъектыНазначенийСтатусов.НазначениеСтатуса <> &НазначениеСтатуса";
	
	Запрос.УстановитьПараметр("мОбъектыНазначения", мОбъектыНазначения);
	Запрос.УстановитьПараметр("НазначениеСтатуса",  Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ШаблонСообщения = "Объект %1 уже назначен для %2";
			ТекстСообщения = СтрШаблон(ШаблонСообщения, Выборка.ОбъектНазначенияСтатуса, Выборка.НазначениеСтатуса);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыНазначенияИдентификаторыОбъектовМетаданныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = СписокВыбораНазначений;

	
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновитьСписокСтатусов");
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыНазначенияИдентификаторыОбъектовМетаданныхПриИзменении(Элемент)
	
	СтрокаНазначения = Элементы.ОбъектыНазначения.ТекущиеДанные;
	СтрокаНазначения.КнопкаНастройка = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ОбъектыНазначенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ОбъектыНазначенияКнопкаНастройка" Тогда
		СтандартнаяОбработка = Ложь;
		
		СтруктураНастроек = ПолучитьКлючНастройки(ВыбраннаяСтрока);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Ключ", СтруктураНастроек.КлючНастроек);
		
		Если СтруктураНастроек.КлючНастроек.Пустая() тогда
			ЗначенияЗаполнения = Новый Структура;
			ЗначенияЗаполнения.Вставить("ИдентификаторОбъекта", СтруктураНастроек.ИдентификаторОбъекта);
			
			ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
		КонецЕсли;
		
		ОткрытьФорму("Справочник.CW_НастройкиВыводаСтатистики.ФормаОбъекта", ПараметрыФормы, ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры 


&НаСервере
Функция ПолучитьКлючНастройки(ВыбраннаяСтрока)
	
	СтрокаНазначения 	= ОбъектыНазначения.НайтиПоИдентификатору(ВыбраннаяСтрока);
	КлючНастроек 		= Справочники.CW_НастройкиВыводаСтатистики.ПолучитьНастройкуПоОбъекту(СтрокаНазначения.ИдентификаторыОбъектовМетаданных);
	
	Результат = Новый Структура;
	Результат.Вставить("КлючНастроек", 			КлючНастроек);
	Результат.Вставить("ИдентификаторОбъекта",  СтрокаНазначения.ИдентификаторыОбъектовМетаданных);
	
	Возврат Результат;
	
КонецФункции
